app/controllers/order_items_controller.rb

  def show
    @order_item = OrderItem.find(params[:id])
---
SELECT * FROM "order_items" WHERE ("order_items"."id" = 1)

  def teteladatai
#    @order_item = OrderItem.find(params[:id])
    @product_type = ProductType.find(params[:id])
    @prints = Print.all
---
SELECT * FROM "product_types" WHERE ("product_types"."id" = 3)
SELECT * FROM "prints"

  def create
    @order_item = OrderItem.new(params[:order_item])

    respond_to do |format|
      if @order_item.save
---
INSERT INTO "order_items" ("darab", "order_id", "updated_at", "print_id", "document_id", "paper_weight_price_id", "paper_type_id", "nev", "product_type_id", "ar_lezart", "created_at") VALUES(NULL, NULL, '2010-08-03 22:27:17', 1, NULL, NULL, NULL, '', NULL, NULL, '2010-08-03 22:27:17')