app/controllers/paper_categories_controller.rb

SELECT * FROM "paper_categories"
---
  def index
    @paper_categories = PaperCategory.all

SELECT * FROM "paper_categories" WHERE ("paper_categories"."id" = 1)
---
  def show
    @paper_category = PaperCategory.find(params[:id])