app/controllers/paper_types_controller.rb

SELECT * FROM "paper_types"
---
  def index
    @paper_types = PaperType.all

SELECT * FROM "paper_types" WHERE ("paper_types"."id" = 1)
---
  def show
    @paper_type = PaperType.find(params[:id])

SELECT * FROM "paper_types" WHERE ("paper_types"."id" = 1)
---
  def edit
    @paper_type = PaperType.find(params[:id])