app/controllers/paper_weight_prices_controller.rb

  def index
    @paper_weight_prices = PaperWeightPrice.all
---
SELECT * FROM "paper_weight_prices"

  def show
    @paper_weight_price = PaperWeightPrice.find(params[:id])
---
SELECT * FROM "paper_weight_prices" WHERE ("paper_weight_prices"."id" = 1)

  def edit
    @paper_weight_price = PaperWeightPrice.find(params[:id])
---
SELECT * FROM "paper_weight_prices" WHERE ("paper_weight_prices"."id" = 1)