app/controllers/prints_controller.rb

SELECT * FROM "prints"
---
  def index
    @prints = Print.all

SELECT * FROM "prints" WHERE ("prints"."id" = 1)
---
  def show
    @print = Print.find(params[:id])

SELECT * FROM "prints" WHERE ("prints"."id" = 1)
---
  def edit
    @print = Print.find(params[:id])