app/controllers/product_categories_controller.rb

  def index
    @product_categories = ProductCategory.all
---
SELECT * FROM "product_categories"

  def show
    @product_category = ProductCategory.find(params[:id])
---
SELECT * FROM "product_categories" WHERE ("product_categories"."id" = 1)

  def edit
    @product_category = ProductCategory.find(params[:id])
---
SELECT * FROM "product_categories" WHERE ("product_categories"."id" = 1)

  def create
    @product_category = ProductCategory.new(params[:product_category])

    respond_to do |format|
      if @product_category.save
---
INSERT INTO "product_categories" ("kep", "updated_at", "nev", "leiras", "created_at") VALUES('', '2010-07-27 22:30:43', 'Képeslap', 'Itt választhatsz képeslapokat!', '2010-07-27 22:30:43')